
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = Истина;
	
	ИнфекцияТолькоДляГруппРиска = Объект.НаличиеВГруппеРиска = Перечисления.ТипыИнфекцияПоВхождениюВГруппыРиска.ВходитВГруппуРиска;
	ИнфекцияЧастичноДляГруппРиска = Объект.НаличиеВГруппеРиска = Перечисления.ТипыИнфекцияПоВхождениюВГруппыРиска.ЧастичноВходитВГруппуРиска;
	ИнфекцияНеВходитВГруппыРиска = Объект.НаличиеВГруппеРиска = Перечисления.ТипыИнфекцияПоВхождениюВГруппыРиска.НеВходитВГруппуРиска;
	
	Элементы.ВходитВНациональныйКалендарь.Видимость = Объект.ВходитВНациональныйКалендарь;
	Элементы.ИнфекцияТолькоДляГруппРиска.Видимость = ИнфекцияТолькоДляГруппРиска;
	Элементы.ИнфекцияЧастичноДляГруппРиска.Видимость = ИнфекцияЧастичноДляГруппРиска;
		
	Элементы.СтраницаДляГруппРискаВозрастВакцинации.Видимость = ИнфекцияТолькоДляГруппРиска Или ИнфекцияЧастичноДляГруппРиска;
	Элементы.СтраницаОбщийВозрастВакцинации.Видимость = ИнфекцияНеВходитВГруппыРиска Или ИнфекцияЧастичноДляГруппРиска;
	
	Если ИнфекцияТолькоДляГруппРиска Или ИнфекцияНеВходитВГруппыРиска Тогда
		Элементы.СтраницыВозрастаВакцинаций.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработкаКомандФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВакциныПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Вакцины.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", ТекущиеДанные.Вакцина);
	
	ОткрытьФорму("Справочник.Вакцины.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

#КонецОбласти