
#Область ПрограммныйИнтерфейс

Функция ПолучитьДатуВакцинацииПоДатеРождения(Знач ДатаРождения, Знач ВозрастВакцинации) Экспорт
	
	МесяцевВакцинации = Цел(ВозрастВакцинации);
	ДатаВакцинации = ДобавитьКДате(ДатаРождения, МесяцевВакцинации, "МЕСЯЦ");
	
	НедельВакцинации = (ВозрастВакцинации - МесяцевВакцинации) * 10;
	ДатаВакцинации = ДобавитьКДате(ДатаВакцинации, НедельВакцинации, "НЕДЕЛЯ");
	
	Возврат ДатаВакцинации	
	
КонецФункции

Функция ДобавитьКДате(ДатаНачала, КоличествоПериодов, ТипПериода) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(&ДатаНачала, ТипПериода, КоличествоПериодов) КАК НоваяДата";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ТипПериода", ТипПериода);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "КоличествоПериодов", КоличествоПериодов);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.Текст = ТекстЗапроса;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.НоваяДата;
	
КонецФункции

#КонецОбласти