
Процедура ОбработчикУведомлений(Уведомление, Локальное, Показано, ДополнительныеПараметры) Экспорт
	
	СтруктураДанных = ОбщегоНазначенияКлиентСервер.ДесериализоватьСтруктуруИзJSON(Уведомление.Данные);
	
	КлючЗаписи = ОбщегоНазначенияСервер.ПолучитьКлючЗаписиРегистраСведений(СтруктураДанных.ИмяРегистра, СтруктураДанных);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", КлючЗаписи);
	
	ОткрытьФорму("РегистрСведений." + СтруктураДанных.ИмяРегистра + ".Форма.ФормаЗаписи", ПараметрыФормы);
		
КонецПроцедуры

Процедура СоздатьИДобавитьУведомление(Заголовок, Текст, ДатаНапоминания, СтруктураДанных) Экспорт
	
	Уведомление = Новый ДоставляемоеУведомление;
    Уведомление.Заголовок = Заголовок;
    Уведомление.Текст = Текст;
	Уведомление.Данные = ОбщегоНазначенияКлиентСервер.СериализоватьСтруктураВJSON(СтруктураДанных);
    Уведомление.ДатаПоявленияУниверсальноеВремя = УниверсальноеВремя(ДатаНапоминания);
    Уведомление.ЗвуковоеОповещение = ЗвуковоеОповещение.ПоУмолчанию;
	
	#Если МобильноеПриложениеКлиент Тогда
		
		ДоставляемыеУведомления.ДобавитьЛокальноеУведомление(Уведомление);    	
		
	#КонецЕсли
	
КонецПроцедуры

Процедура ПодключитьОбработчикУведомлений() Экспорт
	
	#Если МобильноеПриложениеКлиент Тогда
		
		Обработчик = Новый ОписаниеОповещения("ОбработчикУведомлений", ЭтотОбъект);
    	ДоставляемыеУведомления.ПодключитьОбработчикУведомлений(Обработчик);
		
	#КонецЕсли
	
КонецПроцедуры
