
Процедура ОбработчикУведомлений(Уведомление, Локальное, Показано, ДополнительныеПараметры) Экспорт
		
КонецПроцедуры

Процедура СоздатьИДобавитьУведомление(Заголовок, Текст) Экспорт
	
	Уведомление = Новый ДоставляемоеУведомление;
    Уведомление.Заголовок = Заголовок;
    Уведомление.Текст = Текст;
    Уведомление.ДатаПоявленияУниверсальноеВремя = УниверсальноеВремя(ТекущаяДата() + 10);
    Уведомление.ЗвуковоеОповещение = ЗвуковоеОповещение.ПоУмолчанию;
	
	#Если МобильноеПриложениеКлиент Тогда
		
		ДоставляемыеУведомления.ДобавитьЛокальноеУведомление(Уведомление);    	
		
	#КонецЕсли
	
КонецПроцедуры

Процедура ПодключитьОбработчикУведомлений() Экспорт
	
	#Если МобильноеПриложениеКлиент Тогда
		
		Обработчик = Новый ОписаниеОповещения("ОбработчикУведомлений", ЭтотОбъект);
    	ДоставляемыеУведомления.ПодключитьОбработчикУведомлений(Обработчик);
		
	#КонецЕсли
	
КонецПроцедуры
