
#Область ПрограммныйИнтерфейс

Функция ВерсияИБ(ИдентификаторБиблиотеки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВерсииПодсистем.Версия КАК Версия
	|ИЗ
	|	РегистрСведений.ВерсииПодсистем КАК ВерсииПодсистем
	|ГДЕ
	|	ВерсииПодсистем.ИмяПодсистемы = &ИмяПодсистемы";
	
	Запрос.УстановитьПараметр("ИмяПодсистемы", ИдентификаторБиблиотеки);
	ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
	Результат = "";
	Если ТаблицаЗначений.Количество() > 0 Тогда
		Результат = СокрЛП(ТаблицаЗначений[0].Версия);
	КонецЕсли;
	
	Возврат ?(ПустаяСтрока(Результат), "0.0.0", Результат);
	
КонецФункции

Функция ПолучитьИдентификаторТекущейБазы() Экспорт
	
	Возврат "ДетскиеПрививки";
	
КонецФункции

Процедура УстановитьНовуюВерсиюИнформационнойБазы() Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ВерсииПодсистем.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИмяПодсистемы = ПолучитьИдентификаторТекущейБазы();
	МенеджерЗаписи.Версия = Метаданные.Версия;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти