
#Область ПрограммныйИнтерфейс

Функция СформироватьДанныеПрививок() Экспорт
	
	СписокПрививок = Новый Соответствие;
	
	#Область Пентаксим
	
	ДанныеПрививки = ПолучитьСтруктуруДанныхПрививок();
	ДанныеПрививки.Описание = "от Пентаксим";
	
	СписокПрививок.Вставить(Справочники.Прививки.Пентаксим, ДанныеПрививки);
	
	#КонецОбласти
	
	#Область Рототек
	
	ДанныеПрививки = ПолучитьСтруктуруДанныхПрививок();
	ДанныеПрививки.Описание = "от Рототек";
	
	СписокПрививок.Вставить(Справочники.Прививки.Рототек, ДанныеПрививки);
	
	#КонецОбласти
	
	Возврат СписокПрививок;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыФункции

Функция ПолучитьСтруктуруДанныхПрививок()
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Описание");
	
	Возврат СтруктураДанных; 
	
КонецФункции

#КонецОбласти