
#Область ПрограммныйИнтерфейс

Процедура СообщитьПользователю(
		Знач ТекстСообщенияПользователю,
		Знач КлючДанных = Неопределено,
		Знач Поле = "",
		Знач ПутьКДанным = "",
		Отказ = Ложь) Экспорт
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщенияПользователю;
	Сообщение.Поле = Поле;
	Сообщение.КлючДанных = КлючДанных;
	
	Если НЕ ПустаяСтрока(ПутьКДанным) Тогда
		Сообщение.ПутьКДанным = ПутьКДанным;
	КонецЕсли;
		
	Сообщение.Сообщить();
	
	Отказ = Истина;
	
КонецПроцедуры

Функция ПолучитьПредставлениеВозраста(ВозрастВМесяцах) Экспорт
	
	Если ВозрастВМесяцах > 12 Тогда
		
		Годы = Цел(ВозрастВМесяцах / 12);
		
		Если Годы < 5 Тогда
			ПредставлениеВозраста = НСтр("ru = '%1 год. %2 мес.'");
		Иначе
			ПредставлениеВозраста = НСтр("ru = '%1 лет %2 мес.'");
		КонецЕсли;
		
		Месяца = ВозрастВМесяцах - (Годы * 12);
		
		ПредставлениеВозраста = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ПредставлениеВозраста,
			Годы,
			Месяца);
			
		ПредставлениеВозраста = СтрЗаменить(ПредставлениеВозраста, " 0 мес.", "");	
		
	Иначе
		
		ПредставлениеВозраста = НСтр("ru = '%1 мес.'");
		ПредставлениеВозраста = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ПредставлениеВозраста,
			ВозрастВМесяцах);
			
	КонецЕсли;
	
	Возврат ПредставлениеВозраста;
	
КонецФункции

#КонецОбласти