
#Область ПрограммныйИнтерфейс

Функция СформироватьДанныеВакцин() Экспорт
	
	СписокВакцин = Новый Соответствие;
	
	#Область Пентаксим
	
	ДанныеВакцин = ПолучитьСтруктуруДанныхВакцин();
	ДанныеВакцин.Описание = "от Пентаксим";
	
	СписокВакцин.Вставить(Справочники.Вакцины.Пентаксим, ДанныеВакцин);
	
	#КонецОбласти
		
	#Область РегевакВ
	
	ДанныеВакцин = ПолучитьСтруктуруДанныхВакцин();
	ДанныеВакцин.Описание = "от вирусного гепатита В";
	
	СписокВакцин.Вставить(Справочники.Вакцины.РегевакВ, ДанныеВакцин);
	
	#КонецОбласти
	
	#Область Рототек
	
	ДанныеВакцин = ПолучитьСтруктуруДанныхВакцин();
	ДанныеВакцин.Описание = "от Рототек";
	
	СписокВакцин.Вставить(Справочники.Вакцины.Рототек, ДанныеВакцин);
	
	#КонецОбласти

	Возврат СписокВакцин;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыФункции

Функция ПолучитьСтруктуруДанныхВакцин()
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Описание");
	
	Возврат СтруктураДанных; 
	
КонецФункции

#КонецОбласти