
#Область ПрограммныйИнтерфейс

Функция СформироватьДанныеВакцин() Экспорт
	
	СписокВакцин = Новый Соответствие;
	
	#Область ИнфанриксГекса
	
	ДанныеВакцины = ПолучитьСтруктуруДанныхВакцин();
	ДанныеВакцины.Описание = НСтр("ru = 'является одной из самых современных, комбинированных вакцин'");
	ДанныеВакцины.ТипВакциныПоКоличествуИнфекцийОтКоторыхОнаЗащищает = Перечисления.ТипыВакциныПоКоличествуИнфекцийОтКоторыхОниЗащищают.Поливакцина;
	ДанныеВакцины.Отечественная = Ложь;
	ДанныеВакцины.Бесплатная = Ложь;
	ДанныеВакцины.СредняяСтоимость = 7500;
	
	ДанныеВакцины.Инфекции.Добавить(Справочники.Инфекции.ВирусныйГепатитВ);
	ДанныеВакцины.Инфекции.Добавить(Справочники.Инфекции.Столбняк);
	ДанныеВакцины.Инфекции.Добавить(Справочники.Инфекции.Дифтерия);
	ДанныеВакцины.Инфекции.Добавить(Справочники.Инфекции.Коклюш);
	ДанныеВакцины.Инфекции.Добавить(Справочники.Инфекции.Полиомиелит);
	ДанныеВакцины.Инфекции.Добавить(Справочники.Инфекции.ГемофильнаяИнфекция);
	
	СписокВакцин.Вставить(Справочники.Вакцины.ИнфанриксГекса, ДанныеВакцины);
	
	#КонецОбласти
	
	#Область РегевакВ
	
	ДанныеВакцины = ПолучитьСтруктуруДанныхВакцин();
	ДанныеВакцины.Описание = НСтр("ru = 'от вирусного гепатита В'");
	ДанныеВакцины.Бесплатная = Ложь;
	ДанныеВакцины.СредняяСтоимость = 2500;
	
	ДанныеВакцины.Инфекции.Добавить(Справочники.Инфекции.ВирусныйГепатитВ);
	
	СписокВакцин.Вставить(Справочники.Вакцины.РегевакВ, ДанныеВакцины);
	
	#КонецОбласти
	
	#Область ЭнджериксВ
	
	ДанныеВакцины = ПолучитьСтруктуруДанныхВакцин();
	ДанныеВакцины.Описание = НСтр("ru = 'от вирусного гепатита В'");
	ДанныеВакцины.Отечественная = Ложь;
	ДанныеВакцины.Бесплатная = Ложь;
	ДанныеВакцины.СредняяСтоимость = 2000;
	
	ДанныеВакцины.Инфекции.Добавить(Справочники.Инфекции.ВирусныйГепатитВ);
	
	СписокВакцин.Вставить(Справочники.Вакцины.ЭнджериксВ, ДанныеВакцины);
	
	#КонецОбласти
	
	Возврат СписокВакцин;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыФункции

Функция ПолучитьСтруктуруДанныхВакцин()
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Описание");
	СтруктураДанных.Вставить("ТипВакциныПоКоличествуИнфекцийОтКоторыхОнаЗащищает", Перечисления.ТипыВакциныПоКоличествуИнфекцийОтКоторыхОниЗащищают.Моновакцина);
	СтруктураДанных.Вставить("СредняяСтоимость");
	СтруктураДанных.Вставить("Бесплатная", Истина);
	СтруктураДанных.Вставить("Отечественная", Истина);
	СтруктураДанных.Вставить("Инфекции", Новый Массив);
	
	Возврат СтруктураДанных; 
	
КонецФункции

#КонецОбласти