
#Область ПрограммныйИнтерфейс

Функция СформироватьДанныеИнфекций() Экспорт
	
	СписокИнфекций = Новый Соответствие;
	
	#Область ВирусныйГепатитВ
	
	ДанныеИнфекции = ПолучитьСтруктуруДанныхИнфекций();
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(0);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(1);
	ДанныеИнфекции.МесяцаВакцинаций.Добавить(6);
	
	СписокИнфекций.Вставить(Справочники.Инфекции.ВирусныйГепатитВ, ДанныеИнфекции);
	
	#КонецОбласти
	
	Возврат СписокИнфекций;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыФункции

Функция ПолучитьСтруктуруДанныхИнфекций()
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("МесяцаВакцинаций", Новый Массив);
	
	Возврат СтруктураДанных; 
	
КонецФункции

#КонецОбласти