
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Инфекция") Тогда
		ТекстЗагловка = НСтр("ru = 'Вакцины от инфекции %1'");
		ТекстЗагловка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстЗагловка, Параметры.Инфекция);
	Иначе
		ТекстЗагловка = НСтр("ru = 'Вакцины от всех инфекций'");	
	КонецЕсли;
	
	Элементы.Наименование.Заголовок = ТекстЗагловка;
	
	Элементы.ДекорацияПредупреждение.Заголовок = ОбщегоНазначенияКлиентСервер.ТекстПредупрежденияОВакцинах();
	
КонецПроцедуры

#КонецОбласти