
#Область ПрограммныйИнтерфейс

Процедура СформироватьНациональныйКалендарьПрививок(РебенокСсылка, ДатаРождения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнфекцииМесяцаВакцинаций.Ссылка КАК Инфекция,
		|	ИнфекцииМесяцаВакцинаций.Месяц КАК Месяц
		|ИЗ
		|	Справочник.Инфекции.МесяцаВакцинаций КАК ИнфекцииМесяцаВакцинаций";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаМесяцаВакцинаций = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаМесяцаВакцинаций.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.ПрививкиВОчереди.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Ребенок = РебенокСсылка;
		МенеджерЗаписи.Инфекция = ВыборкаМесяцаВакцинаций.Инфекция;
		МенеджерЗаписи.ВозрастВакцинации = ВыборкаМесяцаВакцинаций.Месяц;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти