
#Область ПрограммныйИнтерфейс

Процедура СформироватьКалендарьПрививок(РебенокСсылка, ДатаРождения, Календарь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнфекцииМесяцаВакцинаций.Ссылка КАК Инфекция,
		|	ИнфекцииМесяцаВакцинаций.Месяц КАК Месяц
		|ИЗ
		|	Справочник.КалендариПрививок.СоставКалендаря КАК КалендариПрививокСоставКалендаря
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Инфекции.МесяцаВакцинаций КАК ИнфекцииМесяцаВакцинаций
		|		ПО КалендариПрививокСоставКалендаря.Инфекция = ИнфекцииМесяцаВакцинаций.Ссылка
		|ГДЕ
		|	КалендариПрививокСоставКалендаря.Ссылка = &Календарь";
	
	Запрос.УстановитьПараметр("Календарь", Календарь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаМесяцаВакцинаций = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаМесяцаВакцинаций.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(ВыборкаМесяцаВакцинаций.Инфекция) Тогда
			Продолжить;
		КонецЕсли;
		
		ДатаВакцинации = ОбщегоНазначенияСервер.ПолучитьДатуВакцинацииПоДатеРождения(ДатаРождения, ВыборкаМесяцаВакцинаций.Месяц);
		
		Если НачалоДня(ДатаВакцинации) < НачалоДня(ТекущаяДата()) Тогда
			Продолжить;
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.ПрививкиВОчереди.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Ребенок = РебенокСсылка;
		МенеджерЗаписи.Инфекция = ВыборкаМесяцаВакцинаций.Инфекция;
		МенеджерЗаписи.ДатаВакцинации = ДатаВакцинации;
		МенеджерЗаписи.ВозрастВакцинации = ВыборкаМесяцаВакцинаций.Месяц;
		МенеджерЗаписи.Календарь = Календарь;
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

Процедура СместитьКалендарьПрививок(Ребенок, КоличествоДнейСмещения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрививкиВОчереди.Ребенок КАК Ребенок,
		|	ПрививкиВОчереди.Инфекция КАК Инфекция,
		|	ПрививкиВОчереди.Вакцина КАК Вакцина,
		|	ПрививкиВОчереди.ДатаВакцинации КАК ДатаВакцинации
		|ИЗ
		|	РегистрСведений.ПрививкиВОчереди КАК ПрививкиВОчереди
		|ГДЕ
		|	ПрививкиВОчереди.Ребенок = &Ребенок";
	
	Запрос.УстановитьПараметр("Ребенок", Ребенок);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗапись = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаЗапись.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.ПрививкиВОчереди.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаЗапись);
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			НоваяДатаВакцинации = ОбщегоНазначенияСервер.ДобавитьКДате(МенеджерЗаписи.ДатаВакцинации, КоличествоДнейСмещения, "ДЕНЬ");
			МенеджерЗаписи.ДатаВакцинации = НоваяДатаВакцинации;
			МенеджерЗаписи.ПлановаяДатаВакцинации = НоваяДатаВакцинации;
			МенеджерЗаписи.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьУдалениеКалендаря(Календарь) Экспорт
	
	ОчиститьРеквизитКалендарьВсправочникеДети(Календарь);
	УдалитьПрививкиВОчередиПоКалендарю(Календарь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

Процедура ОчиститьРеквизитКалендарьВсправочникеДети(Календарь)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Дети.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Дети КАК Дети
		|ГДЕ
		|	Дети.Календарь = &Календарь";
	
	Запрос.УстановитьПараметр("Календарь", Календарь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДети = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДети.Следующий() Цикл
		
		ДетиОбъект = ВыборкаДети.Ссылка.ПолучитьОбъект();
		ДетиОбъект.Календарь = Справочники.КалендариПрививок.ПустаяСсылка();
		ДетиОбъект.ОбменДанными.Загрузка = Истина;
		ДетиОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Процедура УдалитьПрививкиВОчередиПоКалендарю(Календарь)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрививкиВОчереди.Ребенок КАК Ребенок,
		|	ПрививкиВОчереди.Инфекция КАК Инфекция,
		|	ПрививкиВОчереди.Вакцина КАК Вакцина,
		|	ПрививкиВОчереди.ДатаВакцинации КАК ДатаВакцинации
		|ИЗ
		|	РегистрСведений.ПрививкиВОчереди КАК ПрививкиВОчереди
		|ГДЕ
		|	ПрививкиВОчереди.Календарь = &Календарь";
	
	Запрос.УстановитьПараметр("Календарь", Календарь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЗапись = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаЗапись.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.ПрививкиВОчереди.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаЗапись);
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			МенеджерЗаписи.Удалить();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти