
#Область ПрограммныйИнтерфейс

Процедура СформироватьНациональныйКалендарьПрививок(РебенокСсылка, ДатаРождения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнфекцииМесяцаВакцинаций.Ссылка КАК Инфекция,
		|	ИнфекцииМесяцаВакцинаций.Месяц КАК Месяц
		|ИЗ
		|	Справочник.Инфекции.МесяцаВакцинаций КАК ИнфекцииМесяцаВакцинаций
		|ГДЕ
		|	ИнфекцииМесяцаВакцинаций.Ссылка.ВходитВНациональныйКалендарь";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаМесяцаВакцинаций = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаМесяцаВакцинаций.Следующий() Цикл
		
		ДатаВакцинации = ОбщегоНазначенияПрививкиСервер.ПолучитьДатуВакцинацииПоДатеРождения(ДатаРождения, ВыборкаМесяцаВакцинаций.Месяц);
		
		Если НачалоДня(ДатаВакцинации) < НачалоДня(ТекущаяДата()) Тогда
			Продолжить;
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.ПрививкиВОчереди.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Ребенок = РебенокСсылка;
		МенеджерЗаписи.Инфекция = ВыборкаМесяцаВакцинаций.Инфекция;
		МенеджерЗаписи.ДатаВакцинации = ДатаВакцинации;
		МенеджерЗаписи.ВозрастВакцинации = ВыборкаМесяцаВакцинаций.Месяц;
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти