
#Область ПрограммныйИнтерфейс

Процедура СформироватьКалендарьПрививок(РебенокСсылка, ДатаРождения, Календарь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнфекцииМесяцаВакцинаций.Ссылка КАК Инфекция,
		|	ИнфекцииМесяцаВакцинаций.Месяц КАК Месяц
		|ИЗ
		|	Справочник.КалендариПрививок.СоставКалендаря КАК КалендариПрививокСоставКалендаря
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Инфекции.МесяцаВакцинаций КАК ИнфекцииМесяцаВакцинаций
		|		ПО КалендариПрививокСоставКалендаря.Инфекция = ИнфекцииМесяцаВакцинаций.Ссылка
		|ГДЕ
		|	КалендариПрививокСоставКалендаря.Ссылка = &Календарь";
	
	Запрос.УстановитьПараметр("Календарь", Календарь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаМесяцаВакцинаций = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаМесяцаВакцинаций.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(ВыборкаМесяцаВакцинаций.Инфекция) Тогда
			Продолжить;
		КонецЕсли;
		
		ДатаВакцинации = ОбщегоНазначенияСервер.ПолучитьДатуВакцинацииПоДатеРождения(ДатаРождения, ВыборкаМесяцаВакцинаций.Месяц);
		
		Если НачалоДня(ДатаВакцинации) < НачалоДня(ТекущаяДата()) Тогда
			Продолжить;
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений.ПрививкиВОчереди.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Ребенок = РебенокСсылка;
		МенеджерЗаписи.Инфекция = ВыборкаМесяцаВакцинаций.Инфекция;
		МенеджерЗаписи.ДатаВакцинации = ДатаВакцинации;
		МенеджерЗаписи.ВозрастВакцинации = ВыборкаМесяцаВакцинаций.Месяц;
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти