
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ТипКалендаря = Перечисления.ТипыКалендаряПрививок.НациональныйКалендарьУтвержденныйМинздравом;
	КонецЕсли;
	
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаКомандФормы

&НаКлиенте
Процедура СформироватьНациональныйКалендарьПрививок(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Или Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	СформироватьНациональныйКалендарьПрививокНаСервере(Объект.Ссылка, Объект.ДатаРождения);
	
	ТекстСообщения = НСтр("ru = 'Календарь сформирован'");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	ОбновитьПовторноИспользуемыеЗначения();
	Оповестить("ОбновитьБлижайшиеСобытий");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипКалендаряПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура УправлениеФормой()
	
	Элементы.СформироватьНациональныйКалендарьПрививок.Видимость = 
		Объект.ТипКалендаря = Перечисления.ТипыКалендаряПрививок.НациональныйКалендарьУтвержденныйМинздравом;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СформироватьНациональныйКалендарьПрививокНаСервере(РебенокСсылка, ДатаРождения)
	
	РаботаСКалендаремСервер.СформироватьНациональныйКалендарьПрививок(РебенокСсылка, ДатаРождения);	
	
КонецПроцедуры

#КонецОбласти