
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаКомандФормы

&НаКлиенте
Процедура СформироватьКалендарьПрививок(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Или Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	СформироватьКалендарьПрививокНаСервере(Объект.Ссылка, Объект.ДатаРождения, Объект.Календарь);
	
	ТекстСообщения = НСтр("ru = 'Календарь сформирован'");
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	ОбновитьПовторноИспользуемыеЗначения();
	Оповестить("ОбновитьФормуНачальнойСтраницы");
	Оповестить("СформированаНациональныйКалендарь");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипКалендаряПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Процедура УправлениеФормой()
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СформироватьКалендарьПрививокНаСервере(РебенокСсылка, ДатаРождения, Календарь)
	
	РаботаСКалендаремСервер.СформироватьКалендарьПрививок(РебенокСсылка, ДатаРождения, Календарь);	
	
КонецПроцедуры

#КонецОбласти