
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьКалендариПрививок() Экспорт
	
	#Область НациональныйКалендарь
	
	ОбъектНациональныйКалендарь = Справочники.КалендариПрививок.НациональныйКалендарь.ПолучитьОбъект();
	ОбъектНациональныйКалендарь.СоставКалендаря.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Инфекции.Ссылка КАК Инфекция
		|ИЗ
		|	Справочник.Инфекции КАК Инфекции
		|ГДЕ
		|	Инфекции.ВходитВНациональныйКалендарь
		|
		|УПОРЯДОЧИТЬ ПО
		|	Инфекции.Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИнфекция = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаИнфекция.Следующий() Цикл
		
		НоваяСтрока = ОбъектНациональныйКалендарь.СоставКалендаря.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаИнфекция);
		
	КонецЦикла;
	
	ОбъектНациональныйКалендарь.ОбменДанными.Загрузка = Истина;
	ОбъектНациональныйКалендарь.Записать();
	
	#КонецОбласти
	
КонецПроцедуры

#КонецОбласти