
#Область ПрограммныйИнтерфейс

Процедура ПроверитьНаличиеОбновленияИнформационнойБазы() Экспорт
	
	ИдентификаторТекущейБазы = ОбновлениеИнформационнойБазыСлужебный.ПолучитьИдентификаторТекущейБазы();
	
	НоваяВерсияИБ = Метаданные.Версия;
	ТекущаяВерсияИБ = ОбновлениеИнформационнойБазыСлужебный.ВерсияИБ(ИдентификаторТекущейБазы);
	
	БылоОбновление = Ложь;
	
	Если ТекущаяВерсияИБ = "0.0.0" Тогда
		ОбновлениеИнформационнойБазыСервер.ПервыйЗапускПрограммы();	
		БылоОбновление = Истина;
	ИначеЕсли НоваяВерсияИБ <> ТекущаяВерсияИБ Тогда
		ОбновлениеИнформационнойБазыСервер.НачатьОбновлениеИнформационнойБазы();
		БылоОбновление = Истина;
	КонецЕсли;
	
	Если БылоОбновление Тогда
		ОбновлениеИнформационнойБазыСлужебный.УстановитьНовуюВерсиюИнформационнойБазы();	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти