
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьПовторноИспользуемыеЗначения();
	Оповестить("ОбновитьФормуНачальнойСтраницы");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаКомандФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура РебенокПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.ДатаВакцинации) Тогда
		Запись.ВозрастВакцинации = ПолучитьВозрастВакцинации(Запись.Ребенок, Запись.ДатаВакцинации);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВозрастВакцинацииПриИзменении(Элемент)
	
	Запись.ДатаВакцинации = ПолучитьДатуВакцинации(Запись.Ребенок, Запись.ВозрастВакцинации);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВакцинацииПриИзменении(Элемент)
	
	Запись.ВозрастВакцинации = ПолучитьВозрастВакцинации(Запись.Ребенок, Запись.ДатаВакцинации);
	
КонецПроцедуры

&НаКлиенте
Процедура ВакцинаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Ссылка", ПолучитьДоступныеВакциныПоИнфекции(Запись.Инфекция));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОткрытьФорму("Справочник.Вакцины.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервереБезКонтекста
Функция ПолучитьДатуВакцинации(Ребенок, ВозрастВакцинации)
	
	ДатаРождения = ОбщегоНазначенияПовтИсп.ПолучитьДатуРожденияРебенка(Ребенок);
	
	Возврат ОбщегоНазначенияСервер.ПолучитьДатуВакцинацииПоДатеРождения(ДатаРождения, ВозрастВакцинации); 	
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВозрастВакцинации(Ребенок, ДатаВакцинации)
	
	ДатаРождения = ОбщегоНазначенияПовтИсп.ПолучитьДатуРожденияРебенка(Ребенок);
	
	Возврат ОбщегоНазначенияСервер.ПолучитьВозрастВакцинацииПоДатеРождения(ДатаРождения, ДатаВакцинации); 	
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДоступныеВакциныПоИнфекции(Инфекция)
	
	Возврат ОбщегоНазначенияСервер.ПолучитьДоступныеВакциныПоИнфекции(Инфекция);
	
КонецФункции

#КонецОбласти