
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьСоставляющиеВозраста();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьПовторноИспользуемыеЗначения();
	Оповестить("ОбновитьФормуНачальнойСтраницы");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаКомандФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура РебенокПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.ДатаВакцинации) Тогда
		Запись.ВозрастВакцинации = ПолучитьВозрастВакцинации(Запись.Ребенок, Запись.ДатаВакцинации);	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.ВозрастВакцинации) Тогда
		Запись.ДатаВакцинации = ПолучитьДатуВакцинации(Запись.Ребенок, Запись.ВозрастВакцинации);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВозрастВакцинацииПриИзменении(Элемент)
	
	Запись.ДатаВакцинации = ПолучитьДатуВакцинации(Запись.Ребенок, Запись.ВозрастВакцинации);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаВакцинацииПриИзменении(Элемент)
	
	Запись.ВозрастВакцинации = ПолучитьВозрастВакцинации(Запись.Ребенок, Запись.ДатаВакцинации);
	ЗаполнитьСоставляющиеВозраста();
	
КонецПроцедуры

&НаКлиенте
Процедура ВакцинаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Ссылка", ПолучитьДоступныеВакциныПоИнфекции(Запись.Инфекция));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОткрытьФорму("Справочник.Вакцины.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛетПриИзменении(Элемент)
	
	РассчитатьВозрастДатуВакцинации();
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцевПриИзменении(Элемент)
	
	РассчитатьВозрастДатуВакцинации();
	
КонецПроцедуры

&НаКлиенте
Процедура НедельПриИзменении(Элемент)
	
	РассчитатьВозрастДатуВакцинации();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервереБезКонтекста
Функция ПолучитьДатуВакцинации(Ребенок, ВозрастВакцинации)
	
	ДатаРождения = ОбщегоНазначенияПовтИсп.ПолучитьДатуРожденияРебенка(Ребенок);
	
	Возврат ОбщегоНазначенияСервер.ПолучитьДатуВакцинацииПоДатеРождения(ДатаРождения, ВозрастВакцинации); 	
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьВозрастВакцинации(Ребенок, ДатаВакцинации)
	
	ДатаРождения = ОбщегоНазначенияПовтИсп.ПолучитьДатуРожденияРебенка(Ребенок);
	
	Возврат ОбщегоНазначенияСервер.ПолучитьВозрастВакцинацииПоДатеРождения(ДатаРождения, ДатаВакцинации); 	
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДоступныеВакциныПоИнфекции(Инфекция)
	
	Возврат ОбщегоНазначенияСервер.ПолучитьДоступныеВакциныПоИнфекции(Инфекция);
	
КонецФункции

&НаКлиенте
Процедура РассчитатьВозрастДатуВакцинации()
	
	Запись.ВозрастВакцинации = (Лет * 12) + Месяцев + (Недель / 10);
	
	Запись.ДатаВакцинации = ПолучитьДатуВакцинации(Запись.Ребенок, Запись.ВозрастВакцинации);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСоставляющиеВозраста()
	
	СоставляющиеВозраста = ОбщегоНазначенияКлиентСервер.РассчитатьСоставляющиеВозраста(Запись.ВозрастВакцинации);
	
	Лет 	= СоставляющиеВозраста.Лет;
	Месяцев = СоставляющиеВозраста.Месяцев;
	Недель  = СоставляющиеВозраста.Недель;
	
КонецПроцедуры

#КонецОбласти